Tekla Open API Reference for Tekla Structures 2025
FacetedBrepFaceHole Class
 The FacetedBrepFaceHole class defines a hole on a faceted BREP face. A FacetedBrepFaceHole cannot be instantiated directly. They are managed internally by a FacetedBrepFace. You can look also at the code example for the class FacetedBrepFace to see more examples.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Geometry3d.FacetedBrepFaceHole
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class FacetedBrepFaceHole
<SerializableAttribute>
Public Class FacetedBrepFaceHole
The FacetedBrepFaceHole type exposes the following members.
Properties
Name | Description
Count
 Gets the count;
IsReadOnly
 Gets a value indicating whether this instance is read only.
VerticeIndexes
 Gets the vertice indexes.
Vertices
 Gets the vertices.
Top
Examples
using System.Linq;
using Tekla.Structures.Geometry3d;
public class Example
{
    public void Example1()
    {
        FacetedBrep brep = SomeFunctionThatReturnFacetedBrep();
        foreach (FacetedBrepFace face in brep.Faces.Where(x => x.HasHoles))
        {
            foreach (FacetedBrepFaceHole hole in face.Holes)
            {
                foreach (Vector vertex in hole.Vertices)
                {
                    Console.WriteLine("Hole point x:{0} y:{1} z:{2}", vertex.X, vertex.Y, vertex.Z);
                }
            }
        }
    }
}
See Also
Reference
Tekla.Structures.Geometry3d Namespace